# Pandas Dataframe drop rows

In [7]:
import pandas as pd

In [8]:
students = [ ('jack', 34, 'Sydeny' , 'Australia') ,
            ('Riti', 30, 'Delhi' , 'India' ) ,
            ('Vikas', 31, 'Mumbai' , 'India' ) ,
            ('Neelu', 32, 'Bangalore' , 'India' ) ,
            ('John', 16, 'New York' , 'US') ,
            ('Mike', 17, 'las vegas' , 'US')  ]

In [9]:
students

[('jack', 34, 'Sydeny', 'Australia'),
 ('Riti', 30, 'Delhi', 'India'),
 ('Vikas', 31, 'Mumbai', 'India'),
 ('Neelu', 32, 'Bangalore', 'India'),
 ('John', 16, 'New York', 'US'),
 ('Mike', 17, 'las vegas', 'US')]

In [10]:
type(students)

list

In [11]:
data = pd.DataFrame(students)

In [12]:
data

       0   1          2          3
0   jack  34     Sydeny  Australia
1   Riti  30      Delhi      India
2  Vikas  31     Mumbai      India
3  Neelu  32  Bangalore      India
4   John  16   New York         US
5   Mike  17  las vegas         US

In [6]:
# Assigning column names to data

In [13]:
type(data)

pandas.core.frame.DataFrame

In [14]:
data = pd.DataFrame(students, columns=['Name','Age','City','Country'])

In [15]:
data

    Name  Age       City    Country
0   jack   34     Sydeny  Australia
1   Riti   30      Delhi      India
2  Vikas   31     Mumbai      India
3  Neelu   32  Bangalore      India
4   John   16   New York         US
5   Mike   17  las vegas         US

In [16]:
data['Age'] > 30

0     True
1    False
2     True
3     True
4    False
5    False
Name: Age, dtype: bool

In [17]:
data['Country'] == "India"

0    False
1     True
2     True
3     True
4    False
5    False
Name: Country, dtype: bool

In [18]:
data[data['Country'] == "India"]

    Name  Age       City Country
1   Riti   30      Delhi   India
2  Vikas   31     Mumbai   India
3  Neelu   32  Bangalore   India

In [19]:
# To remove particular rows, we need to identify its index

In [20]:
data[data['Country'] == "India"].index

Int64Index([1, 2, 3], dtype='int64')

In [21]:
todel = data[data['Country'] == "India"].index

In [23]:
data.drop(todel)

   Name  Age       City    Country
0  jack   34     Sydeny  Australia
4  John   16   New York         US
5  Mike   17  las vegas         US

In [24]:
data

    Name  Age       City    Country
0   jack   34     Sydeny  Australia
1   Riti   30      Delhi      India
2  Vikas   31     Mumbai      India
3  Neelu   32  Bangalore      India
4   John   16   New York         US
5   Mike   17  las vegas         US

In [25]:
# To remove permanently

In [26]:
data.drop(todel, inplace = True)

In [27]:
data

   Name  Age       City    Country
0  jack   34     Sydeny  Australia
4  John   16   New York         US
5  Mike   17  las vegas         US

# Another method

In [28]:
students = [ ('jack', 34, 'Sydeny' , 'Australia') ,
            ('Riti', 30, 'Delhi' , 'India' ) ,
            ('Vikas', 31, 'Mumbai' , 'India' ) ,
            ('Neelu', 32, 'Bangalore' , 'India' ) ,
            ('John', 16, 'New York' , 'US') ,
            ('Mike', 17, 'las vegas' , 'US')  ]

In [29]:
students

[('jack', 34, 'Sydeny', 'Australia'),
 ('Riti', 30, 'Delhi', 'India'),
 ('Vikas', 31, 'Mumbai', 'India'),
 ('Neelu', 32, 'Bangalore', 'India'),
 ('John', 16, 'New York', 'US'),
 ('Mike', 17, 'las vegas', 'US')]

In [30]:
data = pd.DataFrame(students, columns = ['Name','Age','City','Country'])

In [31]:
data

    Name  Age       City    Country
0   jack   34     Sydeny  Australia
1   Riti   30      Delhi      India
2  Vikas   31     Mumbai      India
3  Neelu   32  Bangalore      India
4   John   16   New York         US
5   Mike   17  las vegas         US

In [32]:
data['Age'] > 30

0     True
1    False
2     True
3     True
4    False
5    False
Name: Age, dtype: bool

In [33]:
data[data['Age'] > 30].index

Int64Index([0, 2, 3], dtype='int64')

In [36]:
todel = data[data['Age'] > 30].index

In [37]:
data.drop(todel)

   Name  Age       City Country
1  Riti   30      Delhi   India
4  John   16   New York      US
5  Mike   17  las vegas      US

In [38]:
data

    Name  Age       City    Country
0   jack   34     Sydeny  Australia
1   Riti   30      Delhi      India
2  Vikas   31     Mumbai      India
3  Neelu   32  Bangalore      India
4   John   16   New York         US
5   Mike   17  las vegas         US

In [39]:
data.drop(todel, inplace = True)

In [40]:
data

   Name  Age       City Country
1  Riti   30      Delhi   India
4  John   16   New York      US
5  Mike   17  las vegas      US

# To give it in a single line

In [42]:
students = [ ('jack', 34, 'Sydeny' , 'Australia') ,
            ('Riti', 30, 'Delhi' , 'India' ) ,
            ('Vikas', 31, 'Mumbai' , 'India' ) ,
            ('Neelu', 32, 'Bangalore' , 'India' ) ,
            ('John', 16, 'New York' , 'US') ,
            ('Mike', 17, 'las vegas' , 'US')  ]

In [43]:
data = pd.DataFrame(students, columns = ['Name','Age','City','Country'])

In [44]:
data

    Name  Age       City    Country
0   jack   34     Sydeny  Australia
1   Riti   30      Delhi      India
2  Vikas   31     Mumbai      India
3  Neelu   32  Bangalore      India
4   John   16   New York         US
5   Mike   17  las vegas         US

In [45]:
data.drop(data[data['Age'] > 30].index, inplace=True)

In [46]:
data

   Name  Age       City Country
1  Riti   30      Delhi   India
4  John   16   New York      US
5  Mike   17  las vegas      US

# To remove particular column

In [47]:
students = [ ('jack', 34, 'Sydeny' , 'Australia') ,
            ('Riti', 30, 'Delhi' , 'India' ) ,
            ('Vikas', 31, 'Mumbai' , 'India' ) ,
            ('Neelu', 32, 'Bangalore' , 'India' ) ,
            ('John', 16, 'New York' , 'US') ,
            ('Mike', 17, 'las vegas' , 'US')  ]

In [48]:
data = pd.DataFrame(students, columns = ['Name','Age','City','Country'])

In [49]:
data

    Name  Age       City    Country
0   jack   34     Sydeny  Australia
1   Riti   30      Delhi      India
2  Vikas   31     Mumbai      India
3  Neelu   32  Bangalore      India
4   John   16   New York         US
5   Mike   17  las vegas         US

In [50]:
data.drop(columns=['Age'])

    Name       City    Country
0   jack     Sydeny  Australia
1   Riti      Delhi      India
2  Vikas     Mumbai      India
3  Neelu  Bangalore      India
4   John   New York         US
5   Mike  las vegas         US

In [51]:
data

    Name  Age       City    Country
0   jack   34     Sydeny  Australia
1   Riti   30      Delhi      India
2  Vikas   31     Mumbai      India
3  Neelu   32  Bangalore      India
4   John   16   New York         US
5   Mike   17  las vegas         US

In [53]:
# To drop columns permanently, we need to assign data to some variable

In [54]:
data1 = data.drop(columns=['Age'])

In [55]:
data1

    Name       City    Country
0   jack     Sydeny  Australia
1   Riti      Delhi      India
2  Vikas     Mumbai      India
3  Neelu  Bangalore      India
4   John   New York         US
5   Mike  las vegas         US

In [56]:
data

    Name  Age       City    Country
0   jack   34     Sydeny  Australia
1   Riti   30      Delhi      India
2  Vikas   31     Mumbai      India
3  Neelu   32  Bangalore      India
4   John   16   New York         US
5   Mike   17  las vegas         US

In [58]:
# drop which is used to provide a new dataframe

In [57]:
# To delete permanently

In [59]:
data.pop("Age")

0    34
1    30
2    31
3    32
4    16
5    17
Name: Age, dtype: int64

In [60]:
data

    Name       City    Country
0   jack     Sydeny  Australia
1   Riti      Delhi      India
2  Vikas     Mumbai      India
3  Neelu  Bangalore      India
4   John   New York         US
5   Mike  las vegas         US

In [61]:
students = [ ('jack', 34, 'Sydeny' , 'Australia') ,
            ('Riti', 30, 'Delhi' , 'India' ) ,
            ('Vikas', 31, 'Mumbai' , 'India' ) ,
            ('Neelu', 32, 'Bangalore' , 'India' ) ,
            ('John', 16, 'New York' , 'US') ,
            ('Mike', 17, 'las vegas' , 'US')  ]

In [62]:
data = pd.DataFrame(students, columns = ['Name','Age','City','Country'])

In [63]:
data

    Name  Age       City    Country
0   jack   34     Sydeny  Australia
1   Riti   30      Delhi      India
2  Vikas   31     Mumbai      India
3  Neelu   32  Bangalore      India
4   John   16   New York         US
5   Mike   17  las vegas         US

In [64]:
data['Country'] == 'US'

0    False
1    False
2    False
3    False
4     True
5     True
Name: Country, dtype: bool

In [65]:
data[data['Country'] == 'US']

   Name  Age       City Country
4  John   16   New York      US
5  Mike   17  las vegas      US

In [66]:
data[data['Country'] == 'US'].index

Int64Index([4, 5], dtype='int64')

In [67]:
todel = data[data['Country'] == 'US'].index

In [68]:
todel

Int64Index([4, 5], dtype='int64')

In [70]:
data.drop(todel)

    Name  Age       City    Country
0   jack   34     Sydeny  Australia
1   Riti   30      Delhi      India
2  Vikas   31     Mumbai      India
3  Neelu   32  Bangalore      India

In [71]:
data

    Name  Age       City    Country
0   jack   34     Sydeny  Australia
1   Riti   30      Delhi      India
2  Vikas   31     Mumbai      India
3  Neelu   32  Bangalore      India
4   John   16   New York         US
5   Mike   17  las vegas         US

In [72]:
# To delete permanently

In [73]:
data.drop(todel, inplace=True)

In [74]:
data

    Name  Age       City    Country
0   jack   34     Sydeny  Australia
1   Riti   30      Delhi      India
2  Vikas   31     Mumbai      India
3  Neelu   32  Bangalore      India

In [75]:
students = [ ('jack', 34, 'Sydeny' , 'Australia') ,
            ('Riti', 30, 'Delhi' , 'India' ) ,
            ('Vikas', 31, 'Mumbai' , 'India' ) ,
            ('Neelu', 32, 'Bangalore' , 'India' ) ,
            ('John', 16, 'New York' , 'US') ,
            ('Mike', 17, 'las vegas' , 'US')  ]

In [76]:
data = pd.DataFrame(students, columns = ['Name','Age','City','Country'])

In [77]:
data

    Name  Age       City    Country
0   jack   34     Sydeny  Australia
1   Riti   30      Delhi      India
2  Vikas   31     Mumbai      India
3  Neelu   32  Bangalore      India
4   John   16   New York         US
5   Mike   17  las vegas         US

In [85]:
data[(data['Age'] > 15) & (data['Country'] == "India") & (data['Age'] < 35).index]

    Name  Age       City Country
1   Riti   30      Delhi   India
3  Neelu   32  Bangalore   India